<template>
  <div class="main">
    <div class="character">
      <h1>ジェダイ・ナイト・カル・ケスティス</h1>
      <div class="skills">
        <div class="basic-skill skill">
          <img src="../../assets/assets/ability/tex.ability_jediknightcal_basic.png" class="left">
          <h1 class="right">文化的ではない時代</h1>
          <p>
            ターゲットに物理ダメージを与え、強化効果を全て解除する。<br>
            ジェダイ・ナイト・カル・ケスティスのターンの場合：<br>
            1ターンの間、<span class="yellow">「ワールウィンドスラム」</span> 、<span class="yellow">「ウィンドミルガード」</span>、
            <span class="yellow">「向こう見ずの攻撃」</span>が利用可能になる。ジェダイ・ナイト・カル・ケスティスがボーナスターンを得る。<br>
            このボーナスターン中、ジェダイ・ナイト・カル・ケスティスは挑発効果を無効化し、「ワールウィンドスラム」「ウィンドミルガード」「向こう見ずの攻撃」のみ使用可能。
          </p>
        </div>
        <div class="special-skill1 skill">
          <img src="../../assets/assets/ability/tex.ability_jediknightcal_special01.png" class="left">
          <h1 class="right">ワールウィンドスラム</h1>
          <p>
            <span class="yellow">「スタンス - ダブルブレード」</span>が発生していない場合、ジェダイ・ナイト・カル・ケスティスはスタンスを失い、
            遭遇終了まで「スタンス - ダブルブレード」を獲得し、「向こう見ず」のスタックを5得る(最大30)。<br><br>
            敵全体に物理ダメージを与え、2ターンのスピード低下を発生させる。<br><br>
            ターン開始時、ジェダイ・ナイト・カル・ケスティスに「スタンス - ダブルブレード」が発生していない場合：<br>
            - ターゲットを1ターンの間スタン状態にし、遭遇終了までアーマー破壊を発生させる <br>
            - その他の敵全体を2ターンの間めまいにする<br><br>
            <span class="yellow">スタンス - ダブルブレード：</span> 攻撃力と抵抗力が50%上昇する。「向こう見ず」のスタックごとにスピードが2上昇する。<br><br>
            <span class="white"><b>テリトリーバトルの場合：</b></span> ジェダイ・ナイト・カル・ケスティスは「ウィンドミルガード」の次回使用時、HPとプロテクションが50%回復し、
            「ウィンドミルガード」を最後に使用してから「ワールウィンドスラム」を使用するたび、味方全体がプロテクション上昇(200%)2ターン得る(スタック可能)<br><br>
            ターン開始時、ジェダイ・ナイト・カル・ケスティスも「スタンス - ダブルブレード」が発生していない場合：<br><br>
            - 敵全体を1ターンの間スタン状態にし、遭遇終了までアーマー破壊を発生させる
          </p>
        </div>
        <div class="special-skill2 skill">
          <h1 class="right">ウィンドミルガード</h1>
          <img src="../../assets/assets/ability/tex.ability_jediknightcal_special02.png">
          <p>
            ターン開始時に<span class="yellow">「スタンス - デュアルブレード」</span>が発生していない場合、ジェダイ・ナイト・カル・ケスティスはスタンスを失い、
            遭遇終了まで「スタンス - デュアルブレード」を獲得し、向こう見ずのスタックを5得る(最大30)。<br><br>
            味方全体の弱体化効果を全て解除し、他の指定した味方をアシストに呼ぶ。ジェダイ・ナイト・カル・ケスティスが4ターンの間プロテクション上昇を得る(スタック可能50%、
            コピー不可)。<br><br>
            ターン開始時、ジェダイ・ナイト・カル・ケスティスに「スタンス - デュアルブレード」が発生していない場合：<br>
            - ジェダイ・ナイト・カル・ケスティスは2ターンの間切り返しを得る(コピー、解除、阻止不可)<br>
            - 味方ジェダイが2ターンの間プロテクション上昇(スタック可能20%)と報復効果を得る。<br>
            - 指定した味方ジェダイがボーナスターンを得る。<br><br>
            <span class="yellow">スタンス - デュアルブレード：</span>防御力が50%、カウンター率が100%上昇し、「向こう見ず」のスタックごとに敵の攻撃力が2%減少する。
            他の味方がターン外に攻撃すると、このユニットがアシストに呼ばれる(1ターンにつき1回限り)
          </p>
        </div>
        <div class="special-skill3 skill">
          <h1 class="right">向こう見ずの攻撃</h1>
          <img src="../../assets/assets/ability/tex.ability_jediknightcal_special03.png">
          <p>
            ターン開始時に<span class="yellow">「スタンス - クロスガード」</span>が発生していない場合、ジェダイ・ナイト・カル・ケスティスはスタンスを失い、
            バトル終了まで「スタンス - クロスガード」を獲得し、「向こう見ず」のスタックを5失う。<br><br>
            この遭遇で初めて「向こう見ずの攻撃」が使用されると、ターゲットを即座に戦闘不能にする。<br><br>
            ターゲットに物理ダメージを与える。ターゲットは1ターンの間スキルブロックとよろめき状態になり、敵全体が4ターンの間フォース酔い状態になる。その他味方全体が
            2ターンの間防御突破力上昇を得る。<br><br>
            <span class="yellow">スタンス - クロスガード：</span>クリティカルダメージが50%上昇、防御力が25%減少、スピードが25%減少する。さらに攻撃時に追加でこの
            ユニットの最大HPの25%分をダメージとして与える。<br><br>
            <span class="white"><b>テリトリーバトルの場合：</b></span>「向こう見ずの攻撃」が追加でジェダイ・ナイト・カル・ケスティスのレリックアンプのレベルごとにターゲットの
            最大HP10%分のダメージを与える。「向こう見ずの攻撃」使用後、ジェダイ・ナイト・カル・ケスティスの攻撃はプロテクションを無効化し、味方全体が
            ジェダイ・ナイト・カル・ケスティスの基本攻撃力の300%分をバトル終了まで得る。<br><br>
            <span class="yellow"><b>このスキルはジェダイ・ナイト・カル・ケスティスに「向こう見ず」のスタックが30ないと使用できない。</b></span>
          </p>
        </div>
        <div class=" skill leader">
          <img src="../../assets/assets/abilityui\tex.abilityui_passive_jedi.png" class="left">
          <h1 class="right">銀河の重み</h1>
          <p>
            味方ジェダイのカウンター率、防御力、攻撃力が50%上昇する。<br><br>
            <span class="white"><b>テリトリーバトルの場合：</b></span>バトル開始時、味方の最大HPと最大プロテクションが100%上昇し、ジェダイ・ナイト・カル・ケスティスの
            防御力の300%を得る。各遭遇開始時、味方のターンメーターとフレンジーが2ターンの間25%上昇する。戦闘不能になった敵は復活できない。遭遇が終了しても、
            「向こう見ず」のスタック数は持続する。
          </p>
        </div>
        <div class="skill unike">
          <img src="../../assets/assets/abilityui/tex.abilityui_passive_jedisurvivor.png" class="left">
          <h1 class="right">ジェダイ・サバイバー</h1>
          <p>
            ジェダイ・ナイト・カル・ケスティスはスキルブロック、恐怖、スタンを無効化する。<br><br>
            味方ジェダイがターン外に攻撃すると、ジェダイ・ナイト・カル・ケスティスのHPが10%回復する。<br><br>
            ジェダイの味方全体が敵からのクールダウン操作を無効化する。<br><br>
            味方ジェダイは恐怖状態になると、1ターンのダメージ耐性を得て、ターンメーターが60%上昇する。<br><br>
            ジェダイ・ナイト・カル・ケスティスはスタンスを得るたび、遭遇終了まで<span class="yellow">「向こう見ず」</span>のスタックを5得る（最大30）。<br><br>
            <span class="yellow">向こう見ず：</span>攻撃力が1%上昇し、防御力が1%減少する。スキルに追加効果が発生する
          </p>
        </div>
      </div>
    </div>
  </div>
</template>
  
<style>
.skill {
  border: 1px solid #34ff19;
  margin: 5px;
  padding: 5px;
}
.yellow{
  color: yellow;
}
.white{
  color:white;
}
</style>